% FIS-управление тележкой мостового крана                 (LR_4_MostKran.m)
%==========================================================================
clear all       % очистка памяти (leaving the workspace empty)
clc             % очистка командного окна  (Clear Command Window) 
%--------------------------------------------------------------------------
% Параметры модели
mt = 300.0;     % [кг] масса тележки
mn = 600.0;     % [кг] масса груза
Lp = 10.0;      % [м] длина подвеса
kp = 10;        % [(м/с^2)/В] передаточный коэффициент привода

%	вектор состояния  -    x1=x; x2=v; x3=fi; x4=w;
%	вектор входа      -    y=u           

dT = 0.01;      % [c] период дискретизации

% ---------------------------------------

% % Вариант 1
% mt = 300.0;   mn = 600.0;    Lp = 10.0;   kp = 10.0;
% % Вариант 2
% mt = 600.0;   mn = 400.0;    Lp = 10.0;   kp = 10.0;
% % Вариант 3
% mt = 300.0;   mn = 400.0;    Lp = 30.0;   kp = 10.0;
% % Вариант 4
% mt = 50.0;   mn = 100.0;    Lp = 3.0;   kp = 8.0;
% % Вариант 5
% mt = 40.0;   mn = 50.0;    Lp = 100.0;   kp = 6.0;
% % Вариант 6
% mt = 300.0;   mn = 600.0;    Lp = 100.0;   kp = 20.0;
% % Вариант 7  mn = 6.0;    Lp = 50.0;   kp = 5.0;
% % Вариант 8
% mt = 2.0;   mn = 3.0;    Lp = 10.0;   kp = 2.0;
% % Вариант 9
% mt = 2.0;   mn = 3.8;    Lp = 30.1;   kp = 1.0;
% % Вариант 10
% mt = 80.0;   mn = 150.0;    Lp = 2;   kp = 1.5;

% ---------------------------------------

% По Красноярск 2009 (lab_rab_4_Fuzzy_Logic_TB.doc)
mt = 30.0; a23 = mn*9.81/mt;
a43 = -(mt+mn)*9.81/(mt*Lp);
b2 = kp/mt;
b4 = -kp/(Lp*mt);

A = [0, 1, 0, 0;  0, 0, a23, 0;  0, 0, 0, 1;  0, 0, a43, 0];
B = [0; b2; 0; b4];
C = [1, 0, 0, 0; 0, 1, 0, 0; 0, 0, 1, 0; 0, 0, 0, 1];
D = [0; 0; 0; 0];

X0 = [0; 0; 0; 0];      % Начальные условия

%--------------------------------------------------------------------------
%  Синтез PD - FIS-регулятора положения тележки: U=FIS(Er,dEr)  
% (регулятор создается в среде GUI Fuzzy Logic Toolbox 
%  и сохраняется на диске под именем RgUrVd.fis)
% ---------------------------------------
% fuzzy
fisREG = readfis('RgMostKran_1');
% fisREG = readfis('RgMostKran_1m');
% fuzzy(fisREG)

% Масштабирование сигналов нечёткого регулятора
KEr = 1/40;
KdE = 1/3;
KU = 40;

% ---------------------------------------

